## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_manifest.certificate_resource will be created
+   resource "kubernetes_manifest" "certificate_resource" {
+       manifest = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               name      = "argocd-cert"
+               namespace = "cert-manager"
            }
+           spec       = {
+               commonName = "*.wayofthesys.org"
+               dnsNames   = [
+                   "*.wayofthesys.org",
                ]
+               issuerRef  = {
+                   kind = "ClusterIssuer"
+                   name = "zerossl"
                }
+               secretName = "istio-customingressgateway-certs"
            }
        }
+       object   = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd-cert"
+               namespace                  = "cert-manager"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               additionalOutputFormats = (known after apply)
+               commonName              = "*.wayofthesys.org"
+               dnsNames                = [
+                   "*.wayofthesys.org",
                ]
+               duration                = (known after apply)
+               emailAddresses          = (known after apply)
+               encodeUsagesInRequest   = (known after apply)
+               ipAddresses             = (known after apply)
+               isCA                    = (known after apply)
+               issuerRef               = {
+                   group = (known after apply)
+                   kind  = "ClusterIssuer"
+                   name  = "zerossl"
                }
+               keystores               = {
+                   jks    = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
+                   pkcs12 = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
                }
+               literalSubject          = (known after apply)
+               privateKey              = {
+                   algorithm      = (known after apply)
+                   encoding       = (known after apply)
+                   rotationPolicy = (known after apply)
+                   size           = (known after apply)
                }
+               renewBefore             = (known after apply)
+               revisionHistoryLimit    = (known after apply)
+               secretName              = "istio-customingressgateway-certs"
+               secretTemplate          = {
+                   annotations = (known after apply)
+                   labels      = (known after apply)
                }
+               subject                 = {
+                   countries           = (known after apply)
+                   localities          = (known after apply)
+                   organizationalUnits = (known after apply)
+                   organizations       = (known after apply)
+                   postalCodes         = (known after apply)
+                   provinces           = (known after apply)
+                   serialNumber        = (known after apply)
+                   streetAddresses     = (known after apply)
                }
+               uris                    = (known after apply)
+               usages                  = (known after apply)
            }
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_service_account.redis_service_account will be updated in-place
!   resource "kubernetes_service_account" "redis_service_account" {
        id                              = "kube-argocd/argocd-redis"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "argocd-redis-token-6jtsl" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
